Tekla Open API Reference for Tekla Structures 2025
PourObject.GetPourPolymeshes Method
 Returns a new polymesh enumerator based on merged faces of the pour object in the current plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolymeshEnumerator GetPourPolymeshes()
Public Function GetPourPolymeshes As PolymeshEnumerator
Return Value
Type: PolymeshEnumerator
A polymesh enumerator to enumerate through the solid's faces after merging based on pour object.
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace